mathiscastel29560-arch/Esp32/src/menu.cpp
void runRfAction(int idx) {
    switch (idx) {
        case 0: { // 2.4GHz spectrum
            auto activity = Nrf24Tools::scanChannels(20);
            uint8_t best = 0;
            for (size_t i = 1; i < activity.size(); i++) {
                if (activity[i] > activity[best]) best = i;
            }
            showResult("2.4GHz Spectrum",
                      "Busiest: CH" + String(best) + "\n" +
                      "Activity: " + String(activity[best]));
            break;
        }
        case 1: { // Drone Tracker
            auto result = DroneTracker::scanForDrones(5000);
            if (result.activeDroneCount > 0) {
                showResult("Drone Tracker",
                          "Channels: " + String(result.activeDroneCount) + "\n" +
                          "Avg dist: " + String(result.averageDistance, 1) + "m");
            } else {
                showResult("Drone Tracker", "No signals detected");
            }
            break;
        }
        case 2: { // Signal Sniffer
            auto result = SignalSniffer::sniffTraffic(0xFF, 3000);
            if (result.packetsCapture > 0) {
                bool hopDetected = SignalSniffer::detectFrequencyHopping(result);
                String protocol = SignalSniffer::identifyProtocol(result);
                showResult("Signal Sniffer",
                          "Packets: " + String(result.packetsCapture) + "\n" +
                          "Hopping: " + String(hopDetected ? "YES" : "NO") + "\n" +
                          "Protocol: " + protocol);
            } else {
                showResult("Signal Sniffer", "No packets captured");
            }
            break;
        }
        case 3: { // NRF24 Replay Attack
            auto pkt = Nrf24Replay::capturePacket(1, 3000);
            if (pkt.data.size() > 0) {
                auto result = Nrf24Replay::replayPacket(pkt, 5);
                showResult("NRF24 Replay",
                          "Captured: " + String(pkt.data.size()) + " bytes\n" +
                          "Replayed: " + String(result.packetsSent) + " times");
            } else {
                showResult("NRF24 Replay", "No packets captured");
            }
            break;
        }
        case 4: { // Sub-GHz Scanner
            auto result = SubghzScanner::scanBand(8000);
            if (result.detectionCount > 0) {
                showResult("Sub-GHz Scanner",
                          "Signals: " + String(result.detectionCount) + "\n" +
                          "Strongest: " + String(result.strongestSignal) + "dBm @ " +
                          String(result.busyFrequency, 2) + "MHz");
            } else {
                showResult("Sub-GHz Scanner", "No signals detected");
            }
            break;
        }
        case 5: { // Sub-GHz bruteforce
            auto result = SubghzBruteforce::bruteForce("GENERIC", 15000);
            showResult("Sub-GHz Bruteforce",
                      "Sent " + String(result.attemptsCount) + " codes\n" +
                      "Freq: " + result.frequency + " OOK\n" +
                      "Check device response!");
            break;
        }
        case 6: { // Sub-GHz Replay
            showResult("Sub-GHz Replay",
                      "Record mode not yet\nconfigured in menu\n(see source code)");
            break;
        }
        case 7: { // IR TV toggle
            showResult("IR: TV Power", "Sending codes...\n(requires IR LED)");
            break;
        }
        case 8: { // IR Bruteforce TV
            IRBruteforce::BruteResult result = IRBruteforce::bruteForce("TV", 10000);
            showResult("IR: TV Bruteforce",
                      "Sent " + String(result.attemptsCount) + " codes\n" +
                      "Check if TV responded!");
            break;
        }
        case 9: { // IR Bruteforce AC
            IRBruteforce::BruteResult result = IRBruteforce::bruteForce("AC", 10000);
            showResult("IR: AC Bruteforce",
                      "Sent " + String(result.attemptsCount) + " codes\n" +
                      "Check if AC responded!");
            break;
        }
        case 10: { // IR Bruteforce Light
            IRBruteforce::BruteResult result = IRBruteforce::bruteForce("LIGHT", 10000);
            showResult("IR: Light Bruteforce",
                      "Sent " + String(result.attemptsCount) + " codes\n" +
                      "Check if light responded!");
            break;
        }
        case 11: { // GPS Spoofing
            auto result = GPSSpoof::spoofGPS(48.8566f, 2.3522f, 20000, "SIGNAL");
            showResult("GPS Spoofing",
                      "Packets: " + String(result.packetsCount) + "\n" +
                      "Location: " + String(result.spoofedLat, 4) + ", " + String(result.spoofedLon, 4));
            break;
        }
        case 12: { // Advanced RF Jammer
            if (AdvancedRFJammer::isActive()) {
                AdvancedRFJammer::stop();
                showResult("Advanced RF Jammer", "STOPPED");
            } else {
                auto result = AdvancedRFJammer::jamRFSignals("433MHz", 10000, "NOISE");
                showResult("Advanced RF Jammer",
                          "Packets: " + String(result.jamPacketsCount) + "\n" +
                          "Method: " + result.method);
            }
            break;
        }
        case 13: { // Sub-GHz Jammer Suite
            if (SubghzJammerSuite::isActive()) {
                SubghzJammerSuite::stop();
                showResult("Sub-GHz Jammer", "STOPPED");
            } else {
                auto result = SubghzJammerSuite::jamSubghzDevices(10000);
                showResult("Sub-GHz Jammer Suite",
                          "Codes sent: " + String(result.jamPacketsCount) + "\n" +
                          "Target: 433 MHz");
            }
            break;
        }
        case 14: { // Jamming Signal Generator
            if (JammingSignalGenerator::isActive()) {
                JammingSignalGenerator::stop();
                showResult("Jamming Signal Gen", "STOPPED");
            } else {
                auto result = JammingSignalGenerator::generateJammingSignal(10000, "WHITE");
                showResult("Jamming Signal Generator",
                          "Signals: " + String(result.signalsGenerated) + "\n" +
                          "Type: " + result.noiseType);
            }
            break;
        }
        case 15: { // RF Signal Recorder
            auto result = RfSignalRecorder::recordSignals(433.0, 5000, "cc1101");
            if (result.success) {
                auto stats = RfSignalRecorder::analyzeSignal();
                showResult("RF Signal Recorder",
                          "Samples: " + String(result.sampleCount) + "\n" +
                          "RSSI: " + String(result.rssiAvg, 1) + " dBm\n" +
                          "Transitions: " + String(stats.transitionCount));
            } else {
                showResult("RF Signal Recorder", "Capture failed");
            }
            break;
        }
        case 16: { // Signal Decoder
            auto decoded = SignalDecoder::decodeSignal();
            if (decoded.success) {
                showResult("Signal Decoder",
                          "Format: " + decoded.format + "\n" +
                          "Modulation: " + decoded.modulationType + "\n" +
                          "Bitrate: " + String(decoded.estimatedBitrate) + " bps");
            } else {
                showResult("Signal Decoder", "No captured signal");
            }
            break;
        }
        case 17: { // Advanced Signal Cloner
            AdvancedSignalCloner::CloneParams params;
            params.frequency = 433.0;
            params.repeatCount = 3;
            auto result = AdvancedSignalCloner::cloneSignal(params);
            if (result.success) {
                showResult("Advanced Signal Cloner",
                          "Bytes sent: " + String(result.transmittedBytes) + "\n" +
                          "Reps: " + String(result.repetitionsCompleted) + "\n" +
                          "Radio: " + result.radioUsed);
            } else {
                showResult("Advanced Signal Cloner", "Transmission failed");
            }
            break;
        }
    }
}

void runIotAction(int idx) {
    switch (idx) {
        case 0: { // Zigbee Scanner
            auto result = ZigbeeScanner::scanZigbeeDevices(15000);
            showResult("Zigbee Scanner",
                      "Devices found: " + String(result.deviceCount) + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 1: { // MQTT Hijacker
            auto result = MqttHijacker::scanMqttBrokers(15000);
            showResult("MQTT Hijacker",
                      "Brokers found: " + String(result.brokerCount) + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 2: { // Z-Wave Scanner
            auto result = ZwaveScanner::scanZwaveNetwork(20000);
            showResult("Z-Wave Scanner",
                      "Nodes found: " + String(result.nodeCount) + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 3: { // Bluetooth Classic
            auto result = BluetoothClassic::scanClassicDevices(10000);
            showResult("Bluetooth Classic",
                      "Devices found: " + String(result.deviceCount) + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 4: { // CoAP Scanner
            auto result = CoapScanner::scanCoapServers(15000);
            showResult("CoAP Scanner",
                      "Servers found: " + String(result.serverCount) + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 5: { // LoRaWAN Recon
            auto result = LoRawanRecon::scanLoRawanNetwork(20000);
            showResult("LoRaWAN Recon",
                      "Gateways found: " + String(result.gatewayCount) + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 6: { // RFID Emulator
            auto result = RfidEmulator::emulateRfidCard("HID", 10000);
            showResult("RFID Emulator",
                      "Emulating: " + result.cardType + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 7: { // Mifare Classic
            auto result = MifareClassic::readMifareCard();
            showResult("Mifare Classic",
                      String("Card read complete\n") +
                      "Data: " + result.sectorData.substring(0, 20));
            break;
        }
        case 8: { // NFC Cloner
            auto result = NfcCloner::readNfcTag();
            showResult("NFC Cloner",
                      "UID: " + result.tagUid + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 9: { // Smart Home Hijacker
            auto result = SmarthomeHijacker::hijackPhilipsHue("192.168.1.100", 15000);
            showResult("Smart Home Hijacker",
                      "Devices controlled: " + String(result.devicesControlled) + "\n" +
                      "Bridge: " + result.bridgeIp);
            break;
        }
        case 10: { // Spectrum Analyzer+
            auto result = SpectrumAnalyzerPlus::analyzeSpectrum(400.0, 5000.0, 20000);
            showResult("Spectrum Analyzer+",
                      "Peaks found: " + String(result.peaksFound) + "\n" +
                      "Dominant: " + String(result.dominantFrequency) + " MHz");
            break;
        }
        case 11: { // Modulation Classifier
            auto result = ModulationClassifier::classifyModulation();
            showResult("Modulation Classifier",
                      "Type: " + result.modulationType + "\n" +
                      "Confidence: " + String((int)result.confidence) + "%");
            break;
        }
        case 12: { // Auto Handshake Capture
            auto result = AutoHandshakeCapture::autoCaptureHandshakes(30000);
            showResult("Auto Handshake Capture",
                      "Handshakes: " + String(result.handshakesRecovered) + "\n" +
                      "Targets: " + String(result.targetCount));
            break;
        }
        case 13: { // Generic Packet Tools
            auto result = GenericPacketTools::injectCustomPacket("ATTACK", "auto", 10000);
            showResult("Generic Packet Tools",
                      "Packets sent: " + String(result.packetsSent) + "\n" +
                      "Radio: " + result.radioType);
            break;
        }
        case 14: { // Advanced WiFi Attacks
            auto result = AdvancedWifiAttacks::executeKrackAttack(30000);
            showResult("Advanced WiFi Attacks",
                      "Success: " + String(result.success ? "Yes" : "No") + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
    }
}

void runSystemAction(int idx) {
    switch (idx) {
        case 0: { // TX Arm
            showResult("TX Arm",
                      String(TxArm::isArmed() ? "ARMED" : "LOCKED") + "\n" +
                      "Hold BACK to arm");
            break;
        }
        case 1: { // Battery
            showResult("Battery",
                      String(Battery::percent()) + "%\n" +
                      String(Battery::voltage(), 2) + "V");
            break;
        }
        case 2: { // GPS
            showResult("GPS",
                      String(GpsModule::hasFix() ? "FIX OK" : "No fix") + "\n" +
                      String(GpsModule::latitude(), 4) + " " +
                      String(GpsModule::longitude(), 4));
            break;
        }
        case 3: { // Dualboot
            showResult("Dualboot",
                      "Switching to OTA1...\n(ESP32-DIV)");
            break;
        }
    }
}

void drawSimpleMenu(const std::vector<String> &items, int selection, const String &title) {
    String icon = "";
    if (title == "WIFI TOOLS") icon = "📡 ";
    else if (title == "BLE TOOLS") icon = "🔵 ";
    else if (title == "RF TOOLS") icon = "📶 ";
    else if (title == "IOT/ADVANCED") icon = "🌐 ";
    else if (title == "SYSTEM") icon = "⚙️  ";
    else if (title.indexOf("HELP") >= 0) icon = "❓ ";

    Serial.println("\n═════════════════════════");
    Serial.println("  " + icon + title);
    Serial.println("═════════════════════════");
    for (size_t i = 0; i < items.size(); i++) {
        String line = String(i == selection ? "▶ " : "  ") + items[i];
        Serial.println(line);
    }
    Serial.println("─────────────────────────");
    Serial.println(" ▲/▼: navigate  ●: select  ◄: back");
}

